{"format": "graph-model", "generatedBy": "2.0.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"inputs:0": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "inputs", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_13/zero_padding2d_2/Pad/paddings", "op": "Const", "input": ["^inputs"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_16/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack", "op": "Const", "input": ["^inputs"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack/1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_2/stack_1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack/4", "op": "Const", "input": ["^inputs"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_33/Reshape_2", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add/y", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape_1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape_2", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_17/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/stack/1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape_1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape_2", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_18/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/stack/1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape_1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape_2", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_19/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_20/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_7/sequential_8/conv2d_21/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_7/sequential_8/conv2d_22/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_8/sequential_9/conv2d_23/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_8/sequential_9/conv2d_24/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_31/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "64"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_9/sequential_10/conv2d_25/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_9/sequential_10/conv2d_26/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_10/sequential_11/conv2d_27/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_31/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_10/sequential_11/conv2d_28/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_11/sequential_12/conv2d_29/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_11/sequential_12/conv2d_30/Conv2D/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_transpose_2/mul/y", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_transpose_2/add/y", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_32/Reshape_1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_32/Reshape_2", "op": "Const", "input": ["^inputs"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_33/Reshape_1", "op": "Const", "input": ["^inputs"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/zero_padding2d_2/Pad", "op": "Pad", "input": ["inputs", "StatefulPartitionedCall/sequential_13/zero_padding2d_2/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_16/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_13/zero_padding2d_2/Pad", "StatefulPartitionedCall/sequential_13/conv2d_16/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_13/conv2d_16/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice", "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack/1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_2", "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack/4"], "attr": {"N": {"i": "5"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_13/conv2d_16/Conv2D", "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/SquaredDifference", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add/y", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/mul", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape_2", "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/mul_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/activation_12/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/Reshape_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_17/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_13/activation_12/Relu", "StatefulPartitionedCall/sequential_13/conv2d_17/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_13/conv2d_17/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/strided_slice", "StatefulPartitionedCall/sequential_13/instance_normalization_18/stack/1", "StatefulPartitionedCall/sequential_13/instance_normalization_18/strided_slice_1", "StatefulPartitionedCall/sequential_13/instance_normalization_18/strided_slice_2", "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_13/conv2d_17/Conv2D", "StatefulPartitionedCall/sequential_13/instance_normalization_18/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_18/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/moments/SquaredDifference", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add/y", "StatefulPartitionedCall/sequential_13/instance_normalization_18/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape_1", "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/mul", "StatefulPartitionedCall/sequential_13/instance_normalization_18/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape_2", "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/mul_1", "StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/batchnorm/add_1", "StatefulPartitionedCall/sequential_13/instance_normalization_18/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/activation_13/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_18/Reshape_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/conv2d_18/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_13/activation_13/Relu", "StatefulPartitionedCall/sequential_13/conv2d_18/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_13/conv2d_18/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/strided_slice", "StatefulPartitionedCall/sequential_13/instance_normalization_19/stack/1", "StatefulPartitionedCall/sequential_13/instance_normalization_19/strided_slice_1", "StatefulPartitionedCall/sequential_13/instance_normalization_19/strided_slice_2", "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_13/conv2d_18/Conv2D", "StatefulPartitionedCall/sequential_13/instance_normalization_19/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_19/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/moments/SquaredDifference", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add/y", "StatefulPartitionedCall/sequential_13/instance_normalization_19/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape_1", "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/mul", "StatefulPartitionedCall/sequential_13/instance_normalization_19/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape_2", "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/mul_1", "StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/batchnorm/add_1", "StatefulPartitionedCall/sequential_13/instance_normalization_19/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/activation_14/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_19/Reshape_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_19/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_13/activation_14/Relu", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_19/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_19/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/strided_slice", "StatefulPartitionedCall/sequential_13/instance_normalization_19/stack/1", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/strided_slice_1", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/strided_slice_2", "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack/4"], "attr": {"N": {"i": "5"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_19/Conv2D", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Reshape", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/moments/SquaredDifference", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add/y", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/Rsqrt", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Reshape", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/add_1", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/mul_1", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/batchnorm/add_1", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/activation_15/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_20/Reshape_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_20/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/activation_15/Relu", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_20/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_20/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/Shape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_13/instance_normalization_17/strided_slice/stack_1"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/strided_slice", "StatefulPartitionedCall/sequential_13/instance_normalization_19/stack/1", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/strided_slice_1", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/strided_slice_2", "StatefulPartitionedCall/sequential_13/instance_normalization_17/stack/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/conv2d_20/Conv2D", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/Reshape", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/Reshape", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/moments/SquaredDifference", "StatefulPartitionedCall/sequential_13/instance_normalization_17/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_13/instance_normalization_17/batchnorm/add/y", "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13/resnet_block_6/sequential_7/instance_normalization_21/batchnorm/Rsqrt", 